Revit 2027 API
UIThemeManager.FollowSystemColorTheme Property
 Indicate if the overall theme follows operating system color theme.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool FollowSystemColorTheme { get; set; }
Public Shared Property FollowSystemColorTheme As Boolean
	Get
	Set
public:
static property bool FollowSystemColorTheme {
	bool get ();
	void set (bool value);
}
static member FollowSystemColorTheme : bool with get, set
Property Value
Boolean
See Also
Reference
UIThemeManager Class
Autodesk.Revit.UI Namespace